/*******************************************************************************
    機能名称    ：  プログラムエントリーポイントモジュール
    ファイル名称：  vhal_entry_point.cpp
*******************************************************************************/
#include <cstdint>

#include "vhal_log.h"
#include "vhal_main.h"

/*****************************************************************************
 処理概要：	main関数
 引数    ：	なし
 戻り値  ：	処理結果
           		VHAL_SUCCESS		正常終了
*****************************************************************************/
int32_t main(void) noexcept
{
    int32_t ret{};

	videohal::VhalLogInit();

    ret = videohal::vhal_main();

	videohal::VhalLogEnd();
    return ret;
}

