/*******************************************************************************
    機能名称    ：  内部イベントアイテムベースモジュール
    ファイル名称：  vhal_event_item_base.cpp
*******************************************************************************/
#include "vhal_event_item_base.h"

#include <string>
#include <iostream>

namespace videohal
{

/*****************************************************************************
 処理概要：	コンストラクタ
 引数    ：	なし
 戻り値  ：	なし
*****************************************************************************/
CVhalEventItemBase::CVhalEventItemBase(void) noexcept
{
}

/*****************************************************************************
 処理概要：	イベント名の設定
 引数    ：	const std::string	&event_name	イベント名
 戻り値  ：	なし
*****************************************************************************/
void CVhalEventItemBase::SetName(const std::string &event_name)
{
	event_name_ = event_name;
}

} /* namespace videohal */

