/*******************************************************************************
	機能名称	：	HAL共通部公開ヘッダ
	ファイル名称：	hal_public.h
	作成者		：	AES) k.takahashi
	バージョン	：	2013年09月13日 版
*******************************************************************************/
/******************************************************************************
変更履歴 ：2017.10.13 20PFハード仕様対応
*******************************************************************************/
#ifndef _HAL_PUBLIC_H_
#define _HAL_PUBLIC_H_

/*******************************************************************************
	インクルード
*******************************************************************************/
#include "com_stddef.h"

/*******************************************************************************
	define定義
*******************************************************************************/
/*	HALモジュールID定義 ------------------------------------------------------*/
typedef enum _HalModuleId {
	HAL_ID_GPIO,			/* HAL GPIO */
	HAL_ID_I2C,				/* HAL I2C */
	HAL_ID_SIO,				/* HAL SIO */
	HAL_ID_NUM
} HalModuleId;

/*	API処理結果コード定義 ----------------------------------------------------*/
#define HAL_SUCCESS					(0)			/* 正常終了 */
#define HAL_ERR_ARG					(-1)		/* APIパラメータ異常 */
#define HAL_ERR_MEM_ALLOC			(-2)		/* メモリ確保失敗 */
#define HAL_ERR_MOD					(-3)		/* モジュール状態エラー */
#define HAL_ERR_NOT_SUPPORT			(-4)		/* サポート範囲外 */
#define HAL_ERR_HW					(-5)		/* ハードウェアエラー */
#define HAL_ERR_SYS_CALL			(-6)		/* Linuxシステムコール失敗 */
#define HAL_ERR_RETRY_OVER			(-7)		/* 内部リトライアウト */
#define HAL_ERR_INVALID_HMI_HANDLE	(NULL)		/* 無効なHMIハンドル */

/*******************************************************************************
	型宣言
*******************************************************************************/

/*******************************************************************************
	グローバル変数宣言
*******************************************************************************/

/*******************************************************************************
	プロトタイプ宣言
*******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

void* HalOpen(HalModuleId module_id);
INT32 HalClose(void* hmi);

#if defined(__cplusplus)
}
#endif

#endif /* _HAL_PUBLIC_H_ */
